int/resources/objectRepo/xmlTemplates/opera/Channel/req_ChangeChannelParameters.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/par/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:ChangeChannelParametersRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:Criteria>
            <v91:SystemCode/>
            <v91:ChannelParameters>
               <v91:ChannelParameter HotelCode="?" ParameterValueType="?">
                  <v91:ParameterName/>
                  <v91:ParameterValue/>
               </v91:ChannelParameter>
            </v91:ChannelParameters>
         </v9:Criteria>
      </v9:ChangeChannelParametersRQ>
   </soapenv:Body>
</soapenv:Envelope>